Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettings Property
 SunAndShadowSettings cannot be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopySunAndShadowSettings { get; }
Public Shared ReadOnly Property CannotCopySunAndShadowSettings As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopySunAndShadowSettings {
	FailureDefinitionId^ get ();
}
static member CannotCopySunAndShadowSettings : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace